[
  {
    "year": "1994",
    "name": "The Shawshank Redemption",
    "summary": "Two imprisoned men bond over a number of years, finding solace and eventual redemption through acts of common decency."
  },
  {
    "year": "1972",
    "name": "The Godfather",
    "summary": "The aging patriarch of an organized crime dynasty transfers control of his clandestine empire to his reluctant son."
  },
  {
    "year": "1974",
    "name": "The Godfather: Part II",
    "summary": "The early life and career of Vito Corleone in 1920s New York City is portrayed, while his son, Michael, expands and tightens his grip on the family crime syndicate."
  },
  {
    "year": "2008",
    "name": "The Dark Knight",
    "summary": "When the menace known as the Joker emerges from his mysterious past, he wreaks havoc and chaos on the people of Gotham."
  },
  {
    "year": "1957",
    "name": "12 Angry Men",
    "summary": "A jury holdout attempts to prevent a miscarriage of justice by forcing his colleagues to reconsider the evidence."
  },
  {
    "year": "1993",
    "name": "Schindler's List",
    "summary": "In German-occupied Poland during World War II, Oskar Schindler gradually becomes concerned for his Jewish workforce after witnessing their persecution by the Nazis."
  },
  {
    "year": "2003",
    "name": "The Lord of the Rings: The Return of the King",
    "summary": "Gandalf and Aragorn lead the World of Men against Sauron's army to draw his gaze from Frodo and Sam as they approach Mount Doom with the One Ring."
  },
  {
    "year": "2005",
    "name": "Pulp Fiction",
    "summary": "The lives of two mob hitmen, a boxer, a gangster and his wife, and a pair of diner bandits intertwine in four tales of violence and redemption."
  },
  {
    "year": "1999",
    "name": "Fight Club",
    "summary": "An insomniac office worker and a devil-may-care soapmaker form an underground fight club that evolves into something much, much more."
  },
  {
    "year": "1966",
    "name": "The Good, the Bad and the Ugly",
    "summary": "A bounty hunting scam joins two men in an uneasy alliance against a third in a race to find a fortune in gold buried in a remote cemetery."
  },
  {
    "year": "1954",
    "name": "Seven Samurai",
    "summary": "A poor village under attack by bandits recruits seven unemployed samurai to help them defend themselves."
  },
  {
    "year": "1999",
    "name": "The Matrix",
    "summary": "A computer hacker learns from mysterious rebels about the true nature of his reality and his role in the war against its controllers."
  },
  {
    "year": "1990",
    "name": "Goodfellas",
    "summary": "The story of Henry Hill and his life in the mob, covering his relationship with his wife Karen Hill and his mob partners Jimmy Conway and Tommy DeVito in the Italian-American crime syndicate."
  },
  {
    "year": "1975",
    "name": "One Flew Over the Cuckoo's Nest",
    "summary": "A criminal pleads insanity after getting into trouble again and once in the mental institution rebels against the oppressive nurse and rallies up the scared patients."
  },
  {
    "year": "1995",
    "name": "Se7en",
    "summary": "Two detectives, a rookie and a veteran, hunt a serial killer who uses the seven deadly sins as his motives."
  },
  {
    "year": "1977",
    "name": "Star Wars: Episode IV - A New Hope",
    "summary": "Luke Skywalker joins forces with a Jedi Knight, a cocky pilot, a Wookiee and two droids to save the galaxy from the Empire's world-destroying battle station, while also attempting to rescue Princess Leia from the mysterious Darth Vader."
  },
  {
    "year": "1998",
    "name": "Saving Private Ryan",
    "summary": "Following the Normandy Landings, a group of U.S. soldiers go behind enemy lines to retrieve a paratrooper whose brothers have been killed in action."
  },
  {
    "year": "2010",
    "name": "Inception",
    "summary": "A thief who steals corporate secrets through the use of dream-sharing technology is given the inverse task of planting an idea into the mind of a C.E.O."
  },
  {
    "year": "2002",
    "name": "The Lord of the Rings: The Two Towers",
    "summary": "While Frodo and Sam edge closer to Mordor with the help of the shifty Gollum, the divided fellowship makes a stand against Sauron's new ally, Saruman, and his hordes of Isengard."
  },
  {
    "year": "1980",
    "name": "Star Wars: Episode V - The Empire Strikes Back",
    "summary": "After the Rebels are brutally overpowered by the Empire on the ice planet Hoth, Luke Skywalker begins Jedi training with Yoda, while his friends are pursued by Darth Vader and a bounty hunter named Boba Fett all over the galaxy."
  },
  {
    "year": "1991",
    "name": "The Silence of the Lambs",
    "summary": "A young F.B.I. cadet must confide in an incarcerated and manipulative killer to receive his help on catching another serial killer who skins his victims."
  },
  {
    "year": "1979",
    "name": "Apocalypse Now",
    "summary": "A U.S. Army officer serving in Vietnam is tasked with assassinating a renegade Special Forces Colonel who sees himself as a god."
  },
  {
    "year": "1997",
    "name": "Life Is Beautiful",
    "summary": "When an open-minded Jewish librarian and his son become victims of the Holocaust, he uses a perfect mixture of will, humor, and imagination to protect his son from the dangers around their camp."
  },
  {
    "year": "1994",
    "name": "Forrest Gump",
    "summary": "The presidencies of Kennedy and Johnson, the events of Vietnam, Watergate, and other historical events unfold through the perspective of an Alabama man with an IQ of 75, whose only desire is to be reunited with his childhood sweetheart."
  },
  {
    "year": "1946",
    "name": "It's a Wonderful Life",
    "summary": "An angel is sent from Heaven to help a desperately frustrated businessman by showing him what life would have been like if he had never existed."
  },
  {
    "year": "1998",
    "name": "American History X",
    "summary": "A former neo-nazi skinhead tries to prevent his younger brother from going down the same wrong path that he did."
  },
  {
    "year": "2000",
    "name": "Gladiator",
    "summary": "A former Roman General sets out to exact vengeance against the corrupt emperor who murdered his family and sent him into slavery."
  },
  {
    "year": "1999",
    "name": "The Green Mile",
    "summary": "The lives of guards on Death Row are affected by one of their charges: a black man accused of child murder and rape, yet who has a mysterious gift."
  },
  {
    "year": "1995",
    "name": "The Lion King",
    "summary": "Lion prince Simba and his father are targeted by his bitter uncle, who wants to ascend the throne himself."
  },
  {
    "year": "2014",
    "name": "Whiplash",
    "summary": "A promising young drummer enrolls at a cut-throat music conservatory where his dreams of greatness are mentored by an instructor who will stop at nothing to realize a student's potential."
  },
  {
    "year": "2011",
    "name": "The Intouchables",
    "summary": "After he becomes a quadriplegic from a paragliding accident, an aristocrat hires a young man from the projects to be his caregiver."
  },
  {
    "year": "2006",
    "name": "The Departed",
    "summary": "An undercover cop and a mole in the police attempt to identify each other while infiltrating an Irish gang in South Boston."
  },
  {
    "year": "2002",
    "name": "The Pianist",
    "summary": "A Polish Jewish musician struggles to survive the destruction of the Warsaw ghetto of World War II."
  },
  {
    "year": "1985",
    "name": "Back to the Future",
    "summary": "A young man is accidentally sent thirty years into the past in a time-traveling DeLorean invented by his close friend, eccentric scientist Doc Brown."
  },
  {
    "year": "2001",
    "name": "A Beautiful Mind",
    "summary": "After John Nash, a brilliant but asocial mathematician, accepts secret work in cryptography, his life takes a turn for the nightmarish."
  },
  {
    "year": "2013",
    "name": "Interstellar",
    "summary": "A team of explorers travel through a wormhole in space in an attempt to ensure humanity's survival."
  },
  {
    "year": "1971",
    "name": "A Clockwork Orange",
    "summary": "In the future, a sadistic gang leader is imprisoned and volunteers for a conduct-aversion experiment, but it doesn't go as planned."
  },
  {
    "year": "1994",
    "name": "The Lion King",
    "summary": "Lion prince Simba and his father are targeted by his bitter uncle, who wants to ascend the throne himself."
  },
  {
    "year": "2016",
    "name": "La La Land",
    "summary": "While navigating their careers in Los Angeles, a pianist and an actress fall in love while attempting to reconcile their aspirations for the future."
  },
  {
    "year": "1988",
    "name": "Grave of the Fireflies",
    "summary": "A young boy and his little sister struggle to survive in Japan during World War II."
  },
  {
    "year": "2000",
    "name": "Memento",
    "summary": "A man with short-term memory loss attempts to track down his wife's murderer."
  },
  {
    "year": "1973",
    "name": "The Exorcist",
    "summary": "When a teenage girl is possessed by a mysterious entity, her mother seeks the help of two priests to save her daughter."
  },
  {
    "year": "1981",
    "name": "Raiders of the Lost Ark",
    "summary": "In 1936, archaeologist and adventurer Indiana Jones is hired by the U.S. government to find the Ark of the Covenant before Adolf Hitler's Nazis can obtain its deadly powers."
  },
  {
    "year": "2001",
    "name": "The Lord of the Rings: The Fellowship of the Ring",
    "summary": "A meek Hobbit from the Shire and eight companions set out on a journey to destroy the powerful One Ring and save Middle-earth from the Dark Lord Sauron."
  },
  {
    "year": "1976",
    "name": "Rocky",
    "summary": "A small-time boxer gets a supremely rare chance to fight a heavy-weight champion in a bout in which he strives to go the distance for his self-respect."
  },
  {
    "year": "2004",
    "name": "Eternal Sunshine of the Spotless Mind",
    "summary": "When their relationship turns sour, a couple undergoes a medical procedure to have each other erased from their memories."
  },
  {
    "year": "1986",
    "name": "Aliens",
    "summary": "Ellen Ripley is rescued by a deep salvage team after being in hypersleep for 57 years. The moon that the Nostromo visited has been colonized, but contact is lost. This time, colonial marines have impressive firepower, but will that be enough?"
  },
  {
    "year": "2009",
    "name": "Avatar",
    "summary": "A paraplegic Marine dispatched to the moon Pandora on a unique mission becomes torn between following his orders and protecting the world he feels is his home."
  },
  {
    "year": "1983",
    "name": "Star Wars: Episode VI - Return of the Jedi",
    "summary": "After a daring mission to rescue Han Solo from Jabba the Hutt, the Rebels dispatch to Endor to destroy the second Death Star. Meanwhile, Luke struggles to help Darth Vader back from the dark side without falling into the Emperor's trap."
  },
  {
    "year": "1992",
    "name": "Reservoir Dogs",
    "summary": "When a simple jewelry heist goes horribly wrong, the surviving criminals begin to suspect that one of them is a police informant."
  },
  {
    "year": "1984",
    "name": "Amadeus",
    "summary": "The life, success, and troubles of Wolfgang Amadeus Mozart, as told by Antonio Salieri, the contemporaneous composer who was insanely jealous of Mozart's talent and claimed to have murdered him."
  },
  {
    "year": "1988",
    "name": "My Neighbor Totoro",
    "summary": "When two girls move to the country to be near their ailing mother, they have adventures with the wondrous forest spirits who live nearby."
  },
  {
    "year": "1997",
    "name": "Princess Mononoke",
    "summary": "On a journey to find the cure for a Tatarigami's curse, Ashitaka finds himself in the middle of a war between the forest gods and Tatara, a mining colony."
  },
  {
    "year": "2007",
    "name": "There Will Be Blood",
    "summary": "A story of family, religion, hatred, oil, and madness, focusing on a turn-of-the-century prospector in the early days of the business."
  },
  {
    "year": "2012",
    "name": "Django Unchained",
    "summary": "With the help of a German bounty hunter, a freed slave sets out to rescue his wife from a brutal Mississippi plantation owner."
  },
  {
    "year": "1980",
    "name": "The Shining",
    "summary": "A family heads to an isolated hotel for the winter where a sinister presence influences the father into violence, while his psychic son sees horrific forebodings from both past and future."
  },
  {
    "year": "2006",
    "name": "The Lives of Others",
    "summary": "In 1984 East Berlin, an agent of the secret police, conducting surveillance on a writer and his lover, finds himself becoming increasingly absorbed by their lives."
  },
  {
    "year": "2014",
    "name": "Birdman or (The Unexpected Virtue of Ignorance)",
    "summary": "A washed-up superhero actor attempts to revive his fading career by writing, directing, and starring in a Broadway production."
  },
  {
    "year": "2019",
    "name": "Parasite",
    "summary": "Greed and class discrimination threaten the newly formed symbiotic relationship between the wealthy Park family and the destitute Kim clan."
  },
  {
    "year": "1968",
    "name": "2001: A Space Odyssey",
    "summary": "After discovering a mysterious artifact buried beneath the Lunar surface, mankind sets off on a quest to find its origins with help from intelligent supercomputer H.A.L. 9000."
  },
  {
    "year": "2012",
    "name": "The Dark Knight Rises",
    "summary": "Eight years after the Joker's reign of anarchy, Batman, with the help of the enigmatic Catwoman, is forced from his exile to save Gotham City from the brutal guerrilla terrorist Bane."
  },
  {
    "year": "1991",
    "name": "Terminator 2: Judgment Day",
    "summary": "A cyborg, identical to the one who failed to kill Sarah Connor, must now protect her ten-year-old son, John Connor, from a more advanced and powerful cyborg."
  },
  {
    "year": "2005",
    "name": "Batman Begins",
    "summary": "After training with his mentor, Batman begins his fight to free crime-ridden Gotham City from corruption."
  },
  {
    "year": "2000",
    "name": "Requiem for a Dream",
    "summary": "The drug-induced utopias of four Coney Island individuals are shattered when their addictions run deep."
  },
  {
    "year": "1979",
    "name": "The Deer Hunter",
    "summary": "An in-depth examination of the ways in which the U.S. Vietnam War impacts and disrupts the lives of people in a small industrial town in Pennsylvania."
  },
  {
    "year": "1959",
    "name": "North by Northwest",
    "summary": "A New York City advertising executive goes on the run after being mistaken for a government agent by a group of foreign spies."
  },
  {
    "year": "1954",
    "name": "Rear Window",
    "summary": "A wheelchair-bound photographer spies on his neighbors from his apartment window and becomes convinced one of them has committed murder."
  },
  {
    "year": "1973",
    "name": "Enter the Dragon",
    "summary": "A martial artist agrees to spy on a reclusive crime lord using his invitation to a tournament there as cover."
  },
  {
    "year": "2013",
    "name": "The Wolf of Wall Street",
    "summary": "Based on the true story of Jordan Belfort, from his rise to a wealthy stock-broker living the high life to his fall involving crime, corruption, and the federal government."
  },
  {
    "year": "1986",
    "name": "Ferris Bueller's Day Off",
    "summary": "A high school wise guy is determined to have a day off from school, despite what the Principal thinks of that."
  },
  {
    "year": "1983",
    "name": "Scarface",
    "summary": "In 1980 Miami, a determined Cuban immigrant takes over a drug cartel and succumbs to greed."
  },
  {
    "year": "2015",
    "name": "Mad Max: Fury Road",
    "summary": "In a post-apocalyptic wasteland, a woman rebels against a tyrannical ruler in search of her homeland with the aid of a group of female prisoners, a psychotic worshiper, and a drifter named Max."
  },
  {
    "year": "1976",
    "name": "Taxi Driver",
    "summary": "A mentally unstable veteran works as a nighttime taxi driver in New York City, where the perceived decadence and sleaze fuels his urge for violent action by attempting to liberate a presidential campaign worker and an underage prostitute."
  },
  {
    "year": "1964",
    "name": "Dr. Strangelove or: How I Learned to Stop Worrying and Love the Bomb",
    "summary": "An insane general triggers a path to nuclear holocaust that a War Room full of politicians and generals frantically tries to stop."
  },
  {
    "year": "2018",
    "name": "Avengers: Infinity War",
    "summary": "The Avengers and their allies must be willing to sacrifice all in an attempt to defeat the powerful Thanos before his blitz of devastation and ruin puts an end to the universe."
  },
  {
    "year": "2017",
    "name": "Coco",
    "summary": "Aspiring musician Miguel, confronted with his family's ancestral ban on music, enters the Land of the Dead to find his great-great-grandfather, a legendary singer."
  },
  {
    "year": "1984",
    "name": "Once Upon a Time in America",
    "summary": "A former Prohibition-era Jewish gangster returns to the Lower East Side of Manhattan over thirty years later, where he once again must confront the ghosts and regrets of his old life."
  },
  {
    "year": "2016",
    "name": "Your Name.",
    "summary": "Two strangers find themselves linked in a bizarre way. When a connection forms, will distance be the only thing to keep them apart?"
  },
  {
    "year": "2006",
    "name": "Pan's Labyrinth",
    "summary": "In the Falangist Spain of 1944, the bookish young stepdaughter of a sadistic army officer escapes into an eerie but captivating fantasy world."
  }
]